Experiment/RubyAMF/rubyamf/app/controllers/messages_controller.rb

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("created_at", "updated_at", "text") VALUES('2010-01-05 23:06:03', '2010-01-05 23:06:03', 'first message')