Experiment/MeteorStrike/app/controllers/chats_controller.rb

  def show
    @chat = Chat.find(params[:id])
---
SELECT * FROM "chats" WHERE ("chats"."id" = 1)

  def create
    @chat = Chat.create(params[:chat])
---
INSERT INTO "chats" ("name", "created_at", "updated_at", "message") VALUES('first', '2010-02-10 15:28:41', '2010-02-10 15:28:41', 'first message')